structure/airfoilOptTest1Clean/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	forces
    	{
       		type            forceCoeffs;
        	libs            ("libforces.so");
        	writeControl    writeTime;
        	
		patches
        	(
            		Airfoil_extruded
        	);

        	pName       p;
        	UName       U;
        	rho         rhoInf;

        	rhoInf      1.225;

        	CofR        (0 0 0);
        	liftDir     (0 1 0);
        	dragDir     (1 0 0);
        	pitchAxis   (0 0 1);
        	magUInf     25;
        	lRef        1;
        	Aref        1;
    	}
}

// ************************************************************************* //
