structure/airfoilOptTest1Clean/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	FarField_extruded
	{
		type            freestreamPressure;
        	freestreamValue $internalField;	
	}
	Airfoil_extruded
	{
		type		zeroGradient;
	}

	TopLeft
	{
        	type            empty;
	}
	BottomLeft
	{
       		type            empty;
	}
	TopRight
	{
		type            empty;
	}
	BottomRight
	{
       		type            empty;
	}
	TopLeft_top
	{
	       	type            empty;
	}
	BottomLeft_top
	{
	       	type            empty;
	}
	TopRight_top
	{
	       	type            empty;
	}
	BottomRight_top
	{
	       	type            empty;
	}
}

// ************************************************************************* //
